Revit 2024 API
AdvancedWood.WoodRaySegLengthZ Property
 The property labeled "Length (cm) of z segment containing one ray" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodRaySegLengthZ { get; }
Visual Basic
Public Shared ReadOnly Property WoodRaySegLengthZ As String
	Get
Visual C++
public:
static property String^ WoodRaySegLengthZ {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDistance".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace